{
  "pdf_e262e852_football_player_stats": {
    "schema": {
      "Player Name": "string",
      "Club": "string",
      "League": "string",
      "Goals Scored": "integer",
      "Assists": "integer"
    },
    "description": "## Table Description: `pdf_e262e852_football_player_stats`\n\n### 1. Table Metadata\n\n* **Table Name:** `pdf_e262e852_football_player_stats`\n* **Table Purpose:**  This table stores statistics for football (soccer) players.  It focuses on goals scored and assists provided during a particular season (the specific season is not explicitly defined in the table itself).\n* **Column Names and Data Types:**\n    * `Player Name` (VARCHAR(255)): The name of the football player.\n    * `Club` (VARCHAR(255)): The name of the football club the player represents.\n    * `League` (VARCHAR(255)): The name of the football league the club competes in.\n    * `Goals Scored` (INT): The number of goals scored by the player.\n    * `Assists` (INT): The number of assists provided by the player.\n* **Key Identifier Columns:** There is no explicitly defined primary key.  A composite key of (`Player Name`, `Club`, `League`) could be considered if uniqueness is guaranteed across all three columns.  However, based on the limited sample data, this isn't definitively established.\n\n\n### 2. Sample Data Context\n\n* **Brief Explanation:** The sample data shows statistics for several prominent football players, including their names, clubs, leagues, goals scored, and assists.  The data likely represents a snapshot of statistics from a single season or a specific period.\n* **Data Format and Typical Values:** The data is structured as rows, each representing a single player's statistics.  The `Player Name`, `Club`, and `League` columns contain text strings.  `Goals Scored` and `Assists` contain integer values representing counts.  Values are typically positive integers, representing goal counts and assist counts.\n\n\n### 3. Table Purpose\n\n* **What this table represents:**  A collection of football player statistics, specifically focusing on goals and assists.\n* **Main use case or business function:**  This table supports analytics and reporting on player performance. It could be used to compare players, analyze team performance, or identify top performers within specific leagues.\n\n\n### 4. Common Query Patterns\n\n* **Query Type 1:  Retrieve player statistics for a specific club:**  `SELECT * FROM pdf_e262e852_football_player_stats WHERE Club = 'Manchester City';`\n* **Query Type 2:  Find players who scored more than a certain number of goals:**  `SELECT * FROM pdf_e262e852_football_player_stats WHERE \"Goals Scored\" > 20;`\n* **Query Type 3:  Calculate the total goals scored in a specific league:** `SELECT SUM(\"Goals Scored\") FROM pdf_e262e852_football_player_stats WHERE League = 'Premier League';`\n\n\n### 5. Data Characteristics\n\n* **Total number of records:** 7 (as stated).\n* **Notable data patterns or relationships:** The data suggests a relationship between players, clubs, and leagues.  There's also an implied relationship between goals scored and assists, though not explicitly defined as a constraint. The small sample size prevents identification of more complex patterns.  The table likely represents a subset of a larger dataset.",
    "pdf_uuid": "e262e852",
    "created_at": "2025-07-01T19:36:00.599094",
    "status": "complete",
    "rows_stored": 7
  },
  "pdf_e262e852_player_market_values": {
    "schema": {
      "Player Name": "string",
      "Club": "string",
      "Nationality": "string",
      "Position": "string",
      "Market Value": "currency"
    },
    "description": "## Table Description: `pdf_e262e852_player_market_values`\n\n### 1. Table Metadata\n\n* **Table Name:** `pdf_e262e852_player_market_values`\n* **Table Purpose:** Stores market value information for a set of soccer players.\n* **Columns:**\n    * `Player Name` (VARCHAR(255)): The full name of the soccer player.\n    * `Club` (VARCHAR(255)): The name of the soccer club the player currently plays for.\n    * `Nationality` (VARCHAR(255)): The player's nationality.\n    * `Position` (VARCHAR(255)): The player's primary position on the field.\n    * `Market Value` (FLOAT): The estimated market value of the player in millions (currency symbols are presumed removed during data parsing).  This is a numerical representation.\n\n* **Key Identifier Columns:**  None explicitly defined.  A composite key of `Player Name` and `Club` could be considered for uniqueness, assuming a player can't play for multiple clubs simultaneously within the table's scope.\n\n\n### 2. Sample Data Context\n\nThe sample data shows a small subset of player records, including their names, clubs, nationalities, positions, and market values.  The data suggests a focus on young, high-potential players based on the names and clubs included in the sample.\n\n* **Data Format:** Each row represents a single player.  Column values are text strings (names, clubs, nationalities, positions) and a floating-point number (market value).\n* **Typical Values:** `Player Name` and `Club` are strings, `Nationality` is a country name, `Position` is a soccer position (e.g., \"Attacking Midfielder\", \"Centre-Back\"), and `Market Value` is a positive floating-point number representing millions (e.g., 100 means 100 million).\n\n\n### 3. Table Purpose\n\nThis table represents a snapshot of market values for a selection of soccer players.  It's likely used for analysis, reporting, or as part of a larger system for scouting, player valuation, or financial modeling within the soccer industry.  The specific purpose will depend on the broader application it's integrated into.\n\n\n### 4. Common Query Patterns\n\n* **Retrieve player information:** Select player details (name, club, position, etc.) based on specific criteria like nationality or position.  For example: `SELECT * FROM pdf_e262e852_player_market_values WHERE Nationality = 'Germany';`\n* **Find players within a market value range:** Identify players whose market values fall within a particular range.  For example: `SELECT * FROM pdf_e262e852_player_market_values WHERE Market_Value BETWEEN 70 AND 100;`\n* **Aggregate market value statistics:** Calculate the average, sum, or count of market values for players based on criteria like club or position. For example: `SELECT AVG(Market_Value) FROM pdf_e262e852_player_market_values WHERE Position LIKE '%Midfielder%';`\n\n\n### 5. Data Characteristics\n\n* **Total Number of Records:** 6 (as stated).  Note this is a very small dataset;  a larger table would be more typical for this type of data.\n* **Notable Data Patterns or Relationships:** No clear patterns are evident from the small sample. However, potential relationships could exist between market value and factors like position, club reputation, or player age (data not present in this table).  The data appears biased towards younger, highly valued players.  The absence of an explicit key suggests potential for duplicates if the system allows multiple entries for the same player (though unlikely).\n\n\nThis comprehensive description should enable an LLM to understand the structure, content, and intended use of the `pdf_e262e852_player_market_values` table, facilitating the accurate generation of SQL queries.",
    "pdf_uuid": "e262e852",
    "created_at": "2025-07-01T19:36:09.814207",
    "status": "complete",
    "rows_stored": 6
  },
  "pdf_e262e852_world_cup_results": {
    "schema": {
      "Year": "integer",
      "Host Nation": "string",
      "Winner": "string",
      "Runner-up": "string",
      "Score (Final)": "string"
    },
    "description": "## Table Description: `pdf_e262e852_world_cup_results`\n\n### 1. Table Metadata\n\n* **Table Name:** `pdf_e262e852_world_cup_results`\n* **Table Purpose:** Stores the results of FIFA World Cup final matches.\n* **Column Names and Data Types:**\n    * `Year`: INT (Integer representing the year the World Cup was held)\n    * `Host Nation`: VARCHAR(255) (Text string representing the country that hosted the World Cup)\n    * `Winner`: VARCHAR(255) (Text string representing the country that won the World Cup)\n    * `Runner-up`: VARCHAR(255) (Text string representing the country that was the runner-up)\n    * `Score (Final)`: VARCHAR(255) (Text string representing the final score, potentially including extra time or penalty shootout information)\n* **Key Identifier Columns:** `Year` (implicitly acts as a primary key, assuming each year has only one World Cup final).\n\n\n### 2. Sample Data Context\n\nThe sample data shows a subset of the World Cup final match results.  Each row represents a single World Cup final match, listing the year, host nation, winner, runner-up, and the final score. The `Score (Final)` column may contain additional information, such as \"(AET)\" for extra time or \"(pen)\" for a penalty shootout.  Data is presented in a tabular format with each column representing a specific attribute of a World Cup final match. Typical values for each column are country names (e.g., \"Uruguay\", \"Italy\", \"France\") for `Host Nation`, `Winner`, and `Runner-up`, and numeric scores with possible annotations for `Score (Final)`.\n\n\n### 3. Table Purpose\n\nThis table represents the historical results of FIFA World Cup final matches.  Its main use case is to provide a historical record of World Cup winners, runners-up, scores, and host nations.  This data could be used for analysis, reporting, or displaying information related to past World Cup tournaments.\n\n\n### 4. Common Query Patterns\n\n* **Query Type 1: Retrieving Winner and Runner-up by Year:**  This involves selecting the `Winner` and `Runner-up` columns, filtering by a specific `Year`.  Example: `SELECT Winner, Runner_up FROM pdf_e262e852_world_cup_results WHERE Year = 1998;`\n* **Query Type 2: Counting Wins by Country:** This involves grouping the data by the `Winner` column and counting the number of wins for each country. Example: `SELECT Winner, COUNT(*) AS Wins FROM pdf_e262e852_world_cup_results GROUP BY Winner ORDER BY Wins DESC;`\n* **Query Type 3: Finding Matches Hosted by a Specific Nation:** This involves selecting all columns, filtering the data by `Host Nation`. Example: `SELECT * FROM pdf_e262e852_world_cup_results WHERE \"Host Nation\" = 'Brazil';`\n\n\n### 5. Data Characteristics\n\n* **Total Number of Records:** 22 (as stated)\n* **Notable Data Patterns/Relationships:** The table implicitly shows a one-to-one relationship between the `Year` and the World Cup final match for that year.  The data is ordered chronologically by `Year`.  There might be patterns in the distribution of wins across different nations, which can be revealed through analysis.  The `Score (Final)` column has a non-uniform format due to the inclusion of extra time and penalty shootout notations.",
    "pdf_uuid": "e262e852",
    "created_at": "2025-07-01T19:36:20.157380",
    "status": "complete",
    "rows_stored": 22
  }
}